In [2]:
# import pandas
import pandas as pd

In [3]:
# read csv 
df_exams = pd.read_csv('StudentsPerformance.csv')
df_exams.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

# 1 Adding a New Column

### 1.1 assign()

When to use assign?
* Add multiple columns in a single line of code
* When you need to overwrite the values of an existing columns (best practice)

It returns a new object (a copy) with all the original columns in addition to the new ones

In [4]:
import numpy as np

In [5]:
# create random numbers for our new scores
score1 = np.random.randint(1,100,size=1000)
score2 = np.random.randint(1,100,size=1000)

In [6]:
# create a series using the random numbers
series1 = pd.Series(score1, index=np.arange(0,1000))
series2 = pd.Series(score2, index=np.arange(0,1000))

In [7]:
# assigning the series using the assigne() method
df_exams = df_exams.assign(score1=series1, score2=series2)

In [8]:
# show the DataFrame
df_exams

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,score1,score2
0,female,group B,bachelor's degree,standard,none,72,72,74,83,59
1,female,group C,some college,standard,completed,69,90,88,11,21
2,female,group B,master's degree,standard,none,90,95,93,19,65
3,male,group A,associate's degree,free/reduced,none,47,57,44,15,91
4,male,group C,some college,standard,none,76,78,75,18,44
...,...,...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95,13,73
996,male,group C,high school,free/reduced,none,62,55,55,76,71
997,female,group C,high school,free/reduced,completed,59,71,65,34,40
998,female,group D,some college,standard,completed,68,78,77,38,43
999,female,group D,some college,free/reduced,none,77,86,86,73,94

### 1.2 Insert()

Inserts a new column to a specific position or index.

In [9]:
# using index() to a new column at a specific position
df_exams.insert(1, 'test', series1)

In [10]:
# show the DataFrame
df_exams

,gender,test,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,score1,score2
0,female,83,group B,bachelor's degree,standard,none,72,72,74,83,59
1,female,11,group C,some college,standard,completed,69,90,88,11,21
2,female,19,group B,master's degree,standard,none,90,95,93,19,65
3,male,15,group A,associate's degree,free/reduced,none,47,57,44,15,91
4,male,18,group C,some college,standard,none,76,78,75,18,44
...,...,...,...,...,...,...,...,...,...,...,...
995,female,13,group E,master's degree,standard,completed,88,99,95,13,73
996,male,76,group C,high school,free/reduced,none,62,55,55,76,71
997,female,34,group C,high school,free/reduced,completed,59,71,65,34,40
998,female,38,group D,some college,standard,completed,68,78,77,38,43
999,female,73,group D,some college,free/reduced,none,77,86,86,73,94